import { ref } from 'vue'
/**
 * 平台功能迭代列表数据
 * 用于展示平台的功能更新历史
 */
export const featureUpdates = ref([
  {
    date: '2025-08-23',
    content: '搭建股票分析平台前后端，增加新闻ai分析能力、行业热力图数据、行业rps数据'
  },
  {
    date: '2025-09-14',
    content: '增加用户注册、登录功能，回测功能模块、行业模块、个股模块、基本面模块'
  },
  {
    date: '2025-09-27',
    content: '增加策略选股功能，支持存储展示不同策略的定期结果产出'
  },
  {
    date: '2025-09-28',
    content: '修复数据前复权问题，k线展示异常，回测初始资金默认1000000'
  },
  {
    date: '2025-09-29',
    content: '优化量化模块子页面名称，增加布林带量化策略'
  },
  {
    date: '2025-09-30',
    content: '优化回测结果详情页展示内容，资金、持仓数据和交易盈利数据展示'
  },
  {
    date: '2025-10-01',
    content: '增加股票市场资金流数据展示，包括股票市场资金流入、流出、净额数据'
  },
  {
    date: '2025-10-19',
    content: '增加行业多种数据的热力图展示，后端增加大盘数据采集，个股因子标记，大盘资金数据，目前已经形成了大盘、行业、个股、回测基本框架，还在完善中'
  },
])